Curve in rail sketch is too short for rail creation and ignored.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId RailCurveTooShort { get; }
  Visual Basic
Public Shared ReadOnly Property RailCurveTooShort As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ RailCurveTooShort {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures StairRampFailures Class
  Autodesk.Revit.DB Namespace